trade_exp/src/Documents/ЗаявкаНаОбеспечение/ЗаявкаНаОбеспечение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="beb75e2b-c878-468d-a816-e5bfe85c5dfd">
  <name>ЗаявкаНаОбеспечение</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="fb2b3910-8ef9-4ad0-a7c5-8a7e6e4db07e">
    <name>РабочийФайл</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bdc295bd-dcde-4691-9389-1184c23cd7d4">
    <name>КатегорийныйМенеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e5f5737e-8316-4063-bd0b-54a8fb657c8c">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="202a7bdf-d5bc-44b0-9075-655d038dda5f">
    <name>ВидЗаявки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6ca3376d-62ff-4348-af55-e514f524fb2d">
    <name>Вес</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6972910d-5ab7-4986-a65f-e89f798cb99b">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b4b8fee3-2848-4f00-a40c-cd39e9114256">
    <name>Объем</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>12</precision>
          <scale>4</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="62753ce9-1cfb-4ee8-a6bc-e51c9c7989b6">
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="6be52d38-8af0-44f8-ac89-6658cf6ee1ce">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="7ffb1ccf-128d-43ad-8a74-6b9aa5434e46">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="567082b0-1791-46ed-871b-467604a36c08">
      <name>ТипПотребности</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="28d3067d-98bb-490e-bb30-bfca49bd3ee3">
      <name>Ликвидность</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ba4b2ada-8129-4ef0-bc7b-7b529789bc29">
      <name>Поставщик</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="66043c11-033d-43fc-98ce-d3d6e8315c0b">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4da13fc2-6442-4b0e-98b3-daf7e5caccd6">
      <name>КлассТовара</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fe32a0bb-c1d6-475b-befa-d324a64a1847">
      <name>МетодОбеспечения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="83ea19e0-61d7-468e-90db-0ba3143e37cc">
      <name>СпособОбеспечения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="17102ff3-2b07-4e2c-8a2b-e21577f07b89">
      <name>ВРезерве</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="160948b3-b17c-4070-80af-135ccf380c0e">
      <name>ОптовыеСклады</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b64e3fb4-694d-4144-a60e-03b386a624d4">
      <name>РозничныеСклады</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="565da9de-7c90-4e48-add7-ea32cfd965c4">
      <name>Остаток</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c8812343-295b-4970-9c13-010df7161aac">
      <name>ЗаказыКПоступлению</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4752e2a4-029a-4825-b2f7-ccda6a85d549">
      <name>КЗаказу</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="43495357-361a-4940-a387-d81f43315bc9">
      <name>АлгоритмРасчета</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e703a29c-b8c4-4539-8409-7768dff45930">
      <name>ТрендПараметр</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>12</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="accb9f31-cac2-4741-a1aa-4024f103ce0a">
      <name>ТрендПлан</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>12</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="eb331857-4843-463b-9cc7-243b14bede9a">
      <name>КЗаказуРучной</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/ВариантыОбеспеченияТоварами/ВариантыОбеспеченияТоварами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="7da1b5e1-331e-4dd0-befe-6664dd86bf92">
  <name>ВариантыОбеспеченияТоварами</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <attributes extendedConfigurationObject="03ede1e8-d277-49f1-926b-78a209555ecc">
    <name>РеквизитДопУпорядочивания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="7966bf8b-8dea-418d-8153-75858f8d495b">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4bf6a614-5a3a-48cc-90b9-3fd965f34119">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ea23be2e-cdd4-4995-97a6-35c922d01fb1">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="de53f388-f0a3-4995-b44a-085f5e521468">
    <name>СпособОбеспеченияПотребностей</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Documents/ЗаявкаНаОбеспечение/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

КонецПроцедуры

&НаСервере
Процедура УстановитьПериодыРасхода()
		
	ОписаниеЧисла = ОбщегоНазначения.ОписаниеТипаЧисло(15, 2);
	РеквизитыКДобавлению = Новый Массив;
	ЭлементыКДобавлению = Новый Массив;
	РеквизитыКУдалению = Новый Массив;
	Для к = 1 По КоличествоПериодов Цикл
		РеквизитыКУдалению.Добавить("Объект.Товары.МесяцРасхода" + Строка(к));
	КонецЦикла;	
	Для Каждого Стр Из Объект.Периоды Цикл
		РеквизитКолонкаТаблицы = Новый РеквизитФормы("МесяцРасхода"+стр.Номерстроки,
		ОписаниеЧисла,"Объект.Товары",стр.Период);
		РеквизитыКДобавлению.Добавить(РеквизитКолонкаТаблицы);
		ЭлементыКДобавлению.Добавить(РеквизитКолонкаТаблицы);
	КонецЦикла;		
	ИзменитьРеквизиты(РеквизитыКДобавлению, РеквизитыКУдалению);
	
	Для Каждого ЭлементКДобавлению Из ЭлементыКДобавлению Цикл
		ЭлементКолонка = Элементы.Найти("Товары" + ЭлементКДобавлению.Имя);
		Если ЭлементКолонка = НЕОПРЕДЕЛЕНО тогда
			НовыйЭлемент = Элементы.Вставить("Товары" + ЭлементКДобавлению.Имя, Тип("ПолеФормы"), Элементы.Товары, Элементы.ТоварыМесяцРасходаРастяжка);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
			НовыйЭлемент.ПутьКДанным = "Объект.Товары." + ЭлементКДобавлению.Имя;
			НовыйЭлемент.Заголовок = ЭлементКДобавлению.Заголовок;
			НовыйЭлемент.Ширина = 12;
			НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
			НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
		Иначе
			ЭлементКолонка.Заголовок = ЭлементКДобавлению.Заголовок;
		КонецЕсли;
	КонецЦикла;                                         
	
	КоличествоПериодов = Объект.Периоды.Количество();  
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодыРасхода()
	
	Для Каждого период Из Объект.Периоды Цикл
		Для Каждого стр Из Объект.Товары Цикл
			СтрокаРасход = Объект.ТоварыРасход.НайтиСтроки(Новый Структура("Номенклатура,ДатаНачала",стр.Номенклатура,период.ДатаНачала));
			Если строкаРасход <> Неопределено И строкаРасход.Количество() <> 0 тогда
				стр["МесяцРасхода" + Период.НомерСтроки] = строкарасход[0].Количество;
			КонецЕсли;	
		КонецЦикла;	
	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Процедура ПериодРасходаПриИзменении(Элемент)
	
	Объект.ДатаНачалаРасхода = ПериодРасхода.ДатаНачала;
	Объект.ДатаОкончанияРасхода = ПериодРасхода.ДатаОкончания; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодыРасхода(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("АдресВХранилище",ТаблицаПериодовВХранилище());
	Оповещение = Новый ОписаниеОповещения("ПериодыРасходаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
    ОткрытьФорму("Документ.ЗаявкаНаОбеспечение.Форма.ФормаВыбораПериодов",ДополнительныеПараметры,ЭтаФорма,истина,,,Оповещение);

КонецПроцедуры 

&НаСервере
Функция ТаблицаПериодовВХранилище()
	Возврат ПоместитьВоВременноеХранилище(Объект.Периоды.Выгрузить());
КонецФункции 

&НаКлиенте
Процедура ПериодыРасходаЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	ПериодыРасходаЗавершениеСервер(ВыбранноеЗначение, ДополнительныеПараметры)

КонецПроцедуры

&НаСервере
Процедура ПериодыРасходаЗавершениеСервер(ВыбранноеЗначение, ДополнительныеПараметры)
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		ТаблицаПериодов = ПолучитьИзВременногоХранилища(ВыбранноеЗначение);
		Объект.Периоды.Загрузить(ТаблицаПериодов);
		ЭтаФорма.Модифицированность = Истина;
		УстановитьПериодыРасхода();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварыРасход()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВР_Периоды.НомерСтроки КАК НомерСтроки,
		|	ВР_Периоды.ДатаНачала КАК ДатаНачала
		|ПОМЕСТИТЬ ВР_Периоды
		|ИЗ
		|	&ВР_Периоды КАК ВР_Периоды
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Выручка.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	СУММА(Выручка.КоличествоОборот) КАК Количество,
		|	Выручка.Период КАК ДатаНачала,
		|	ВР_Периоды.НомерСтроки КАК КлючСвязи
		|ИЗ
		|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(, , Месяц, АналитикаУчетаНоменклатуры.Номенклатура В (&МассивНоменклатуры)) КАК Выручка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВР_Периоды КАК ВР_Периоды
		|		ПО Выручка.Период = ВР_Периоды.ДатаНачала
		|ГДЕ
		|	&Условие
		|
		|СГРУППИРОВАТЬ ПО
		|	Выручка.АналитикаУчетаНоменклатуры.Номенклатура,
		|	Выручка.Период,
		|	ВР_Периоды.НомерСтроки";
	
	Запрос.УстановитьПараметр("ВР_Периоды", Объект.Периоды.Выгрузить());
	Запрос.УстановитьПараметр("МассивНоменклатуры", Объект.Товары.Выгрузить().ВыгрузитьКолонку("Номенклатура"));
	ТекстУсловия = ""; ТекстПоля = "";
	Для Каждого стр Из Объект.Периоды Цикл
		ТекстУсловия = ТекстУсловия + ?(ТекстУсловия = "", "", " или ") + "
		| Выручка.Период МЕЖДУ датавремя(" + Стрзаменить(ГОД(стр.ДатаНачала), Символы.НПП, "") + "," + месяц(стр.ДатаНачала) + "," + День(стр.ДатаНачала) + ") и датавремя(" + стрзаменить(ГОД(стр.ДатаОкончания), символы.Нпп,"") + "," + месяц(стр.ДатаОкончания) + "," + День(стр.ДатаОкончания) + ")";
	КонецЦикла;	
	
	Запрос.Текст = стрзаменить(Запрос.Текст,"&Условие",ТекстУсловия);
	РезультатЗапроса = Запрос.Выполнить();
	Объект.ТоварыРасход.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьТаблицуТоваров();
	ЗаполнитьТоварыРасход();
	ЗаполнитьПериодыРасхода();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуТоваров ()
	
	Если Не значениезаполнено(Объект.РабочийФайл) Тогда
		Возврат;
	КонецЕсли;
	МассивНоменклатуры = Новый Массив;
	МассивСкладов = Новый Массив;
	
	Настройки = Объект.РабочийФайл.ХранилищеНастроек.получить();
	Если Настройки <> НЕОПРЕДЕЛЕНО Тогда
		Если Настройки.Свойство("МассивНоменклатуры") Тогда
			МассивНоменклатуры = Настройки.МассивНоменклатуры;
		КонецЕсли;
		Если Настройки.Свойство("СкладыОстатков") Тогда
			МассивСкладов = Настройки.СкладыОстатков.ВыгрузитьКолонку("СкладПолучатель");;
		КонецЕсли;	
	КонецЕсли;	
	ТипОбеспечения = Объект.РабочийФайл.ТипОбеспечения;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();

	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	Запрос.УстановитьПараметр("МассивСкладов", МассивСкладов);
	Запрос.УстановитьПараметр("ТипОбеспечения", ТипОбеспечения);
		
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВариантыОбеспеченияТоварами.Номенклатура КАК Номенклатура,
		|	ВариантыОбеспеченияТоварами.Характеристика КАК Характеристика,
		|	ВариантыОбеспеченияТоварами.Склад КАК Склад,
		|	ВариантыОбеспеченияТоварами.СпособОбеспеченияПотребностей КАК СпособОбеспечения
		|ПОМЕСТИТЬ ВтТовары
		|ИЗ
		|	РегистрСведений.ВариантыОбеспеченияТоварами КАК ВариантыОбеспеченияТоварами
		|ГДЕ
		|	ВариантыОбеспеченияТоварами.Номенклатура В ИЕРАРХИИ(&МассивНоменклатуры)
		|	И ВариантыОбеспеченияТоварами.СпособОбеспеченияПотребностей.ТипОбеспечения = &ТипОбеспечения
		|	И ВариантыОбеспеченияТоварами.Склад В(&МассивСкладов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Способы.СпособОбеспечения КАК СпособОбеспечения,
		|	Способы.СпособОбеспечения.ФормироватьПлановыеЗаказы КАК ФормироватьПлановыеЗаказы,
		|	NULL КАК ДатаПоставки
		|ПОМЕСТИТЬ ВтСпособыОбеспеченияПереопределенный
		|ИЗ
		|	ВтТовары КАК Способы";
	Запрос.Выполнить();
		
	Запрос = Обработки.ОбеспечениеПотребностей.ЗапросПоЗапасам(Запрос);
	РезультатЗапроса = Запрос.Выполнить();
	
	Объект.Товары.Загрузить(РезультатЗапроса.Выгрузить());

КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	ПараметрыКоманды = Новый Структура("Ссылка,Идентификатор,этоОтчет");
	ПараметрыКоманды.Идентификатор = Объект.Ссылка;	
	ПараметрыКоманды.Ссылка = ДопОбработка();
	ПараметрыКоманды.ЭтоОтчет = Ложь;	
	ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьОткрытиеФормыОбработки(ПараметрыКоманды,ЭтаФорма,Новый Массив());
	Закрыть(); 
	
КонецПроцедуры

&НаСервере
Функция ДопОбработка()	
	Возврат Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Расчет потребности");	
КонецФункции
